OpenFOAM-v2106/applications/test/multiWorld/chtMultiRegionSimpleFoam/fluid/0/topAir/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/topAir";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0.1 0 0 );

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    top
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    left
    {
        type            fixedValue;
        value           uniform ( 0.1 0 0 );
    }
    right
    {
        type            inletOutlet;
        value           uniform ( 0.1 0 0 );
        inletValue      uniform ( 0 0 0 );
    }
    bottom
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
